## ابوالفضل وکیلی هستم
# نام پروژه : پایگاه دانش
### درس اصوال طراحی پایگاه داده
###  پروژه را اول ترم با جنگو پیاده سازی نموده ام 
### این پروژه که پروژه دوم می باشد ، صفر تا صد دیتابیس آن طراحی شده و برای نمونه، گزارش هایی نیز در آخر به این پروژه اضافه گردیده است
## جداول و روابط بین آنها تنها به صورت کد نبوده و به صورت گرافیکی برای درک درست آماده گردیده است
## نام استاد : جناب آقای دکتر قاضی خانی
### دانشگاه بین المللی امام رضا ع

# در ابتدا کتابخانه ای که بتوان به اس کیو ال سرور کانکشن زد را وارد محیط برنامه پایتون می نماییم

In [28]:
import pyodbc

# جهت ایجاد پایگاه داده به مستر متصل می شویم

In [12]:
server_name = '.'
db_name = 'master'
conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=' + server_name + ';'
                      'Database=' + db_name + ';'
                      'Trusted_Connection=yes;' , 
                      autocommit=True)

# با استفاده از کوئری زیر پایگاه داده خود را ایجاد می نماییم

In [13]:
create_db_query = '''
Create database PaigahDanesh
on(name=PaigahDanesh_Datafile,filename='D:\db_project\PaigahDanesh_Datafile.mdf',size=5mb,maxsize=5GB,filegrowth=10%)

Log on
(name=PaigahDanesh_DataLog,filename='D:\db_project\PaigahDanesh_Datafile.ldf',size=5mb,maxsize=5GB,filegrowth=10%)
'''

In [ ]:
cursor = conn.cursor()
cursor.execute(create_db_query)

# به پایگاه داده ایجاد شده خود متصل می شویم

In [79]:
server_name = '.'
db_name = 'PaigahDanesh'
conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=' + server_name + ';'
                      'Database=' + db_name + ';'
                      'Trusted_Connection=yes;' , 
                      autocommit=True)

# با استفاده از کوئری زیر، جداول مورد نظر خود را جهت انجام سناریو پایگاه دانش ساخته ام

In [61]:
query_create_tables = '''
    CREATE TABLE STAFF
(ID INT IDENTITY (1,1), FirstName nvarchar(40), LastName nvarchar(50), Administartor bit ,constraint PK_STAFF_ID primary key(ID))

CREATE TABLE CUSTOMER
(ID int IDENTITY (1,1), FirstName nvarchar(40), LastName nvarchar(50), constraint PK_CUSTOMER_ID primary key(ID))

CREATE TABLE DOCUMENTATION
(ID INT IDENTITY (1,1), FileAddress nvarchar(200), CUSTOMER_ID int, STAFF_ID int, constraint PK_DOCUMENTATION_ID primary key(ID))


CREATE TABLE COMMENT
(ID INT IDENTITY (1,1), Test ntext, COMMENT_ID int ,CUSTOMER_ID int,DOCUMENTATION_ID int, STAFF_ID int, constraint PK_COMMENT_ID primary key(ID))
        '''

# همانطور که در خروجی کد زیر مشاهده می نمایید ، آبجکتی به معنای درست بود فرایند ساخت جداول برگردانده می شود

In [62]:
cursor.execute(query_create_tables)

# با استفاده از دستورات زیر ارتباط بین جداول را مشخص می نماییم

In [63]:
FK = '''
        ALTER TABLE DOCUMENTATION
        ADD CONSTRAINT FK_STAFF_DOCUMENTATION
        FOREIGN KEY (STAFF_ID) REFERENCES STAFF(ID);
        ALTER TABLE DOCUMENTATION
        ADD CONSTRAINT FK_CUSTOMER_DOCUMENTATION
        FOREIGN KEY (CUSTOMER_ID) REFERENCES CUSTOMER(ID);

        ----------------------
        ALTER TABLE COMMENT
        ADD CONSTRAINT FK_STAFF_COMMENT
        FOREIGN KEY (STAFF_ID) REFERENCES STAFF(ID);

        ALTER TABLE COMMENT
        ADD CONSTRAINT FK_CUSTOMER_COMMENT
        FOREIGN KEY (CUSTOMER_ID) REFERENCES CUSTOMER(ID);

        ALTER TABLE COMMENT
        ADD CONSTRAINT FK_COMMENT_COMMENT
        FOREIGN KEY (COMMENT_ID) REFERENCES COMMENT(ID);

        ALTER TABLE COMMENT
        ADD CONSTRAINT FK_DOCUMENTATION_COMMENT
        FOREIGN KEY (DOCUMENTATION_ID) REFERENCES DOCUMENTATION(ID);
    '''

In [64]:
cursor.execute(FK)

# چه جداولی تولید گردیدند؟

In [65]:
show_tables = '''
                SELECT
                  *
                FROM
                  INFORMATION_SCHEMA.TABLES;
            '''

In [66]:
cursor.execute(show_tables)
for i in cursor:
    print(i)

('PaigahDanesh', 'dbo', 'STAFF', 'BASE TABLE')
('PaigahDanesh', 'dbo', 'CUSTOMER', 'BASE TABLE')
('PaigahDanesh', 'dbo', 'DOCUMENTATION', 'BASE TABLE')
('PaigahDanesh', 'dbo', 'COMMENT', 'BASE TABLE')
('PaigahDanesh', 'dbo', 'sysdiagrams', 'BASE TABLE')

# تا کنون دیتابیس ما خالی است. که قصد دارم آن ها را با کوئری هایی که در زیر آمده پر نمایم

In [67]:
insert_STAFF = '''INSERT INTO STAFF(FirstName, LastName, Administartor)
                    VALUES ('ابوالفضل', 'وکیلی', 1);
                    
                    INSERT INTO STAFF(FirstName, LastName, Administartor)
                    VALUES ('علیرضا', 'محمدی', 0);
                    
                    INSERT INTO STAFF(FirstName, LastName, Administartor)
                    VALUES ('مهرداد', 'باقری', 0);
                    
                    INSERT INTO STAFF(FirstName, LastName, Administartor)
                    VALUES ('ناصر', 'باقرپور', 0);
                    
                    INSERT INTO STAFF(FirstName, LastName, Administartor)
                    VALUES ('ابراهیم', 'ابراهیمی', 0);
                    
                    INSERT INTO STAFF(FirstName, LastName, Administartor)
                    VALUES ('محمد', 'صادقی', 0);
            '''

In [68]:
cursor.execute(insert_STAFF)

In [70]:
insert_CUSTOMER = '''
INSERT INTO CUSTOMER(FirstName, LastName)
VALUES ('محمد', 'علیزاده')

INSERT INTO CUSTOMER(FirstName, LastName)
VALUES ('محمد', 'علیمردانی')

INSERT INTO CUSTOMER(FirstName, LastName)
VALUES ('محمد', 'اصفهانی')


INSERT INTO CUSTOMER(FirstName, LastName)
VALUES ('علی', 'ابراهیم زاده')


INSERT INTO CUSTOMER(FirstName, LastName)
VALUES ('مصطفی', 'شریف زاده')

INSERT INTO CUSTOMER(FirstName, LastName)
VALUES ('مریم', 'مشهدی')

INSERT INTO CUSTOMER(FirstName, LastName)
VALUES ('مازیار', 'فلاحی')
'''

In [71]:
cursor.execute(insert_CUSTOMER)

In [72]:
insert_DOCUMENTATION = '''
insert into DOCUMENTATION (FileAddress, CUSTOMER_ID, STAFF_ID)
values('C:\\file1.pdf', (select ID from STAFF where FirstName like N'ابوالفضل'), (select ID from CUSTOMER where FirstName like N'مصطفي'))

insert into DOCUMENTATION (FileAddress, CUSTOMER_ID, STAFF_ID)
values('C:\\file2.pdf', (select ID from STAFF where FirstName like N'ابوالفضل'), (select ID from CUSTOMER where FirstName like N'علي'))

insert into DOCUMENTATION (FileAddress, CUSTOMER_ID, STAFF_ID)
values('C:\\file3.pdf', (select ID from STAFF where FirstName like N'ابوالفضل'), (select ID from CUSTOMER where FirstName like N'مريم'))

insert into DOCUMENTATION (FileAddress, CUSTOMER_ID, STAFF_ID)
values('C:\\file4.pdf', (select ID from STAFF where FirstName like N'محمد'), (select ID from CUSTOMER where FirstName like N'مريم'))

insert into DOCUMENTATION (FileAddress, CUSTOMER_ID, STAFF_ID)
values('C:\\file5.pdf', (select ID from STAFF where FirstName like N'عليرضا'), (select ID from CUSTOMER where FirstName like N'مصطفي'))

insert into DOCUMENTATION (FileAddress, CUSTOMER_ID, STAFF_ID)
values('C:\\file6.pdf', (select ID from STAFF where FirstName like N'ابوالفضل'), (select ID from CUSTOMER where FirstName like N'مصطفي'))
'''

In [73]:
cursor.execute(insert_DOCUMENTATION)

# وحالا گزارشات

In [75]:
import pandas as pd

### بیاید در ابتدا تیبل ها را به صورت خام مشاهده نمایید

In [88]:
staff_data = '''select * from STAFF'''
staff = pd.read_sql(staff_data, conn)
staff

   ID FirstName  LastName  Administartor
0   1  ابوالفضل     وکيلي           True
1   2    عليرضا     محمدي          False
2   3    مهرداد     باقري          False
3   4      ناصر   باقرپور          False
4   5   ابراهيم  ابراهيمي          False
5   6      محمد     صادقي          False

In [89]:
customer_data = '''select * from CUSTOMER'''
customer = pd.read_sql(customer_data, conn)
customer

   ID FirstName      LastName
0   1      محمد       عليزاده
1   2      محمد     عليمرداني
2   3      محمد       اصفهاني
3   4       علي  ابراهيم زاده
4   5     مصطفي     شريف زاده
5   6      مريم         مشهدي
6   7    مازيار         فلاحي

In [91]:
DOCUMENTATION_query = '''select * from DOCUMENTATION'''
DOCUMENTATION = pd.read_sql(DOCUMENTATION_query, conn)
DOCUMENTATION

   ID   FileAddress  CUSTOMER_ID  STAFF_ID
0   1     asdasdasd            1         5
1   2  C:\file1.pdf            1         5
2   3  C:\file2.pdf            1         4
3   4  C:\file3.pdf            1         6
4   5  C:\file4.pdf            6         6
5   6  C:\file5.pdf            2         5
6   7  C:\file6.pdf            1         5

In [92]:
COMMENT_query = '''select * from COMMENT'''
COMMENT = pd.read_sql(COMMENT_query, conn)
COMMENT

   ID          Test  COMMENT_ID  CUSTOMER_ID  DOCUMENTATION_ID  STAFF_ID
0   1    testdsfsdf         NaN            1                 1         1
1   2      sfdfsdfd         1.0            2                 2         2
2   3  NUewrwerweLL         NaN            3                 1         2
3   4           vxc         NaN            2                 2         3
4   5    vxcvxcvcvx         1.0            3                 3         5
5   6        vcvcxv         NaN            4                 5         5

# گزارشات سناریو ها

### به عنوان یک مدیر می خواهم بتوانم اطلاعات همه کارمندان  را مشاهده نمایم

In [76]:
query = '''
    select concat(FirstName, ' ', LastName) as name, case when Administartor like 1 then 'مدیر' else 'کارمند' end as admin from STAFF
'''

In [85]:
staff_list = pd.read_sql(query, conn)
staff_list.columns = ['نام و نام خانوادگی', 'سمت']
staff_list

  نام و نام خانوادگی     سمت
0     ابوالفضل وکيلي    مدير
1       عليرضا محمدي  کارمند
2       مهرداد باقري  کارمند
3       ناصر باقرپور  کارمند
4   ابراهيم ابراهيمي  کارمند
5         محمد صادقي  کارمند

## گزارش جامع

In [96]:
query = '''select concat(s.firstname, ' ', s.lastname) as name , c.test as message, concat(cu.firstname, ' ', cu.lastname) as customer from STAFF as s
inner join Comment as c on s.id = c.id
inner join customer as cu on cu.id = c.id'''

Q1= pd.read_sql(query, conn)
Q1.columns = ['نام و نام خانوادگی کارمند', 'متن پیام ارسالی', 'نام و نام خانوادگی مشتری']
Q1

  نام و نام خانوادگی کارمند متن پیام ارسالی نام و نام خانوادگی مشتری
0            ابوالفضل وکيلي      testdsfsdf             محمد عليزاده
1              عليرضا محمدي        sfdfsdfd           محمد عليمرداني
2              مهرداد باقري    NUewrwerweLL             محمد اصفهاني
3              ناصر باقرپور             vxc         علي ابراهيم زاده
4          ابراهيم ابراهيمي      vxcvxcvcvx          مصطفي شريف زاده
5                محمد صادقي          vcvcxv               مريم مشهدي

## هر مشتری چند کامنت ثبت نموده؟

In [101]:
query = '''
with tmp_table(name, n)
as
(select concat(firstname, ' ', lastname) as name , c.test from Customer as cu
inner join comment as c on c.customer_id = cu.id)
select name, count(*) from tmp_table
group by name
'''
Q2 = pd.read_sql(query, conn)
Q2.columns = ['نام و نام خانوادگی مشتری', 'تعداد پیام ارسالی']
Q2

  نام و نام خانوادگی مشتری  تعداد پیام ارسالی
0         علي ابراهيم زاده                  1
1             محمد اصفهاني                  2
2             محمد عليزاده                  1
3           محمد عليمرداني                  2

## هر کارمند چند تا کامنت ثبت نموده؟

In [102]:
query = '''

with tmp_table(name, n)
as
(select concat(firstname, ' ', lastname) as name , c.test from Staff as s
inner join comment as c on c.staff_id = s.id)
select name, count(*) from tmp_table
group by name
'''
Q3 = pd.read_sql(query, conn)
Q3.columns = ['نام و نام خانوادگی کارمند', 'تعداد پیام ارسالی']
Q3

  نام و نام خانوادگی کارمند  تعداد پیام ارسالی
0          ابراهيم ابراهيمي                  2
1            ابوالفضل وکيلي                  1
2              عليرضا محمدي                  2
3              مهرداد باقري                  1